Repository: ElanDeyan/my-quotes-app
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Settings
pt: Configurações

source: Theme mode
pt: Tema

# chooseThemeModeMessage
source: Choose a theme mode
pt: Escolha um tema

# themeModeName
source: {themeMode,select, system{System} light{Light} dark{Dark} other{Missing theme mode}}
pt: {themeMode,select, system{Padrão do sistema} light{Claro} dark{Escuro} other{Falta tema}}

source: Color pallete
pt: Paleta de cores

# chooseColorPaletteMessage
source: Choose a color palette
pt: Escolha uma paleta de cores

# colorPaletteName
source: {colorPalette,select, cool_blush{Cool blush} fire_engine_red{Fire engine red} icy_lilac{Icy lilac} misty_mint{Misty mint} oxford_blue{Oxford blue} powder_blue{Powder blue} soft_apricot{Soft apricot} vanilla{Vanilla} other{Missing color palete translation}}
pt: {colorPalette,select, cool_blush{Blush frio} fire_engine_red{Vermelho bombeiro} icy_lilac{Lilás gelado} misty_mint{Menta enevoada} oxford_blue{Azul Oxford} powder_blue{Azul bebê} soft_apricot{Damasco suave} vanilla{Baunilha} other{Falta tradução}}

# language
source: App language
pt: Idioma do app

# chooseAppLanguage
source: Choose an app language
pt: Escolha um idioma

# languageName
source: {language,select, en{English} pt{Brazilian Portuguese} other{Missing language}}
pt: {language,select, en{Inglês} pt{Português brasileiro} other{Falta idioma}}

source: Info
pt: Sobre o app

# infoDescription
source: Thanks for using this app! I hope you're enjoying! This' my first published app and your sharing can help me to find jobs and oportunities. :-) To support my work, share with your friends and follow me in my social medias:
pt: Obrigado por usar este app! Espero que esteja gostando! Este é meu primeiro app publicado e seu compartilhamento pode me ajudar a conseguir trabalhos e oportunidades. :-) Para apoiar meu trabalho, compartilhe com seus amigos e me siga nas minhas redes sociais:

# navigationHome
source: Home
pt: Início

# navgationMyQuotes
source: My Quotes
pt: Frases

# navigationSettings
source: Settings
pt: Configurações

# navigationTags
source: Tags
pt: Etiquetas

# navigationSearchQuote
source: Search quote
pt: Pesquisar frase

# navigationSearchTag
source: Search tag
pt: Pesquisar etiqueta

# navigationSearchClear
source: Clear search
pt: Limpar busca

# navigationSearchLabel
source: Search
pt: Buscar

# navigationBack
source: Back
pt: Voltar

# navigationAddQuote
source: Add a new quote
pt: Adicionar frase

# navigationAddTag
source: Add a new tag
pt: Adicionar etiqueta

# quoteActionsPopupButtonTooltip
source: Actions
pt: Mais ações

# quoteActions
source: {action, select, other{Missing action} info{Info} view_quote{View quote} create{Create} edit{Edit} copy{Copy} share{Share} copy_link{Copy Link} go_to_link{Go to link} delete{Delete}}
pt: {action, select, other{Falta adicionar} info{Informações} view_quote{Ver frase} create{Adicionar} edit{Editar} copy{Copiar} share{Compartilhar} copy_link{Copiar link} go_to_link{Acessar link} delete{Deletar}}

source: Tags
pt: Etiquetas

# tagActionsPopupButtonTooltip
source: Actions
pt: Mais ações

# tagActions
source: {action, select, other{Missing action} edit{Edit} delete{Delete}}
pt: {action, select, other{Falta adicionar} edit{Editar} delete{Deletar}}

source: Create tag
pt: Adicionar etiqueta

source: No results found
pt: Nenhum resultado encontrado

# addQuoteTitle
source: Add quote
pt: Adicionar frase

# editQuoteTitle
source: Edit quote
pt: Editar frase

# quoteFormError
source: An error occurred
pt: Ocorreu um erro

# quoteFormFieldContent
source: Content
pt: Frase

# quoteFormFieldAuthor
source: Author
pt: Autor(a)

# quoteFormFieldAnonymAuthor
source: Anonym
pt: Anônimo

# quoteFormFieldSource
source: Source
pt: Fonte

# quoteFormFieldSourceHintText
source: A movie, book, event, place and etc
pt: Um filme, livro, evento, lugar etc

# quoteFormFieldSourceUri
source: Source link
pt: Link da fonte

# quoteFormFieldSourceUriHintText
source: Link to the source
pt: Link para a fonte

# quoteFormFieldIsFavorite
source: Favorite?
pt: Favoritar?

# quoteFormFieldTags
source: Tags
pt: Etiquetas

# quoteFormFieldTagsHintText
source: Tag name
pt: Nome da etiqueta

# quoteFormActionButtonAdd
source: Add quote
pt: Adicionar frase

# quoteFormActionButtonEdit
source: Save
pt: Salvar

# quoteFormSuccessfulAdd
source: Successfully added!
pt: Adicionado com sucesso!

# quoteFormSuccessfulEdit
source: Successfully updated!
pt: Editado com sucesso!

# invalidLink
source: Enter a valid link.
pt: Insira um URL válido.

# nonEmptyField
source: Field {field} cannot be empty.
pt: Campo ''{field}'' não pode ser vazio.

source: Created!
pt: Adicionado!

source: Tag name
pt: Nome da etiqueta

# tagNameFieldHint
source: Characters with accents will be replaced with equivalents
pt: Caracteres com acentos serão substituídos por equivalentes

# tagNameFieldRules
source: Tag name should have only letters, digits, dashes or underlines
pt: Nome deve ter apenas letras, números, hífens ou sublinha

# requiredFieldAlert
source: Required field
pt: Campo obrigatório

# emptyOrBlankAlert
source: Can''t have only blank spaces
pt: Não pode ter somente espaços em branco

# disallowedCommasAlert
source: Commas aren''t allowed
pt: Não pode ter vírgulas

source: Cancel
pt: Cancelar

source: Save
pt: Salvar

source: Delete
pt: Deletar

# deleteTag
source: Delete "{tagName}" tag?
pt: Deletar etiqueta "{tagName}"?

source: Are you sure?
pt: Tem certeza?

# irreversibleAction
source: This action can''t be undone.
pt: Essa ação não poderá ser desfeita.

# deleteTagEffects
source: Quotes with this tag will only lose that tag.
pt: Frases com esta etiqueta irão apenas perder ela.

source: Update tag
pt: Editar etiqueta

source: New tag name
pt: Novo nome

# quoteNotFoundWithId
source: Quote with this {id} not found.
pt: Frase com o id {id} não encontrada.

# noDatabaseConnectionMessage
source: No database connection.
pt: Sem conexão com o banco de dados.

# errorOccurred
source: An error has occurred.
pt: Um erro aconteceu.

source: Quotes with this tag
pt: Frases com esta etiqueta

# noQuotesWithTag
source: No quotes with this tag found.
pt: Nenhuma frase com esta etiqueta encontrada.

source: Quote info
pt: Detalhes

source: Edit
pt: Editar

source: Copied to clipboard!
pt: Copiado para a área de transferência!

source: Deleted
pt: Deletado

source: Updated!
pt: Atualizado!

# isFavorite
source: {isFavorite, select, other{Invalid} true{Is favorited.} false{Is not favorited.}}
pt: {isFavorite, select, other{Inválido} true{Favorito.} false{Não favorito.}}

# noQuotesAddedYet
source: You don''t have any quotes yet.
pt: Você ainda não tem frases adicionadas.

# noTagsAddedYet
source: You don''t have any tags yet.
pt: Você ainda não tem etiquetas adicionadas.

# quoteWithoutTags
source: You don''t added tags for this quote.
pt: Nenhuma etiqueta adicionada.

source: No tags found.
pt: Nenhuma etiqueta encontrada.

# quoteShareHeader
source: Take a look at this quote:
pt: Olha essa frase:

# quoteShareSeeMore
source: See more in: {url}
pt: Veja mais em: {url}

# parseQuoteFileErrorMessageNotJsonFormat
source: The content is not a JSON data
pt: Conteúdo não é um JSON válido

# parseQuoteFileErrorMessageNotJsonMap
source: The content is not a JSON map
pt: Conteúdo não é um objeto JSON

# parseQuoteFileErrorMessageNotCaseFields
source: JSON error: Data mismatch. Check fields and types
pt: Erro: Dados inconsistentes. Verifique os campos e dados

# parseQuoteFileErrorMessageNoChosenFile
source: No file selected
pt: Nenhum arquivo selecionado

# addFromFile
source: Upload from file
pt: Adicionar de um arquivo

# quoteFileParseError
source: An error occurred when parsing the file
pt: Não foi possível processar o arquivo

# backupFileParseError
source: An error occurred when parsing the backup file
pt: Não foi possível processar o arquivo de backup

source: Create backup
pt: Criar backup

source: Restore backup
pt: Restaurar backup

# restoreData
source: Restore
pt: Restaurar

# restoreQuestion
source: Do you want to recover your backup data?
pt: Você deseja restaurar os dados deste backup?

# restoreAdvice
source: Remember: ALL of your local data will be lost and replaced by your backup.
pt: Lembre-se: TODOS os seus dados locais serão substituídos.

# feedbackButtonLabel
source: Help me to improve this app
pt: Ajude a melhorar este app

source: Provide feedback
pt: Feedback

# feedbackInstructions
source: Navigate through the app and type below what do you want.
pt: Navegue até a tela desejada e escreva abaixo o que quer que melhore

# feedbackTextLabel
source: Your feedback
pt: Seu feedback

# feedbackSend
source: Send feedback
pt: Enviar feedback

source: Successful operation!
pt: Operação realizada com sucesso!

# quotesListViewSortingButton
source: Sort
pt: Ordenar

# quotesListViewSortingButtonTooltip
source: Show menu
pt: Ver opções

# quotesListViewSortingCreatedAtAsc
source: Oldest first
pt: Mais antigos

# quotesListViewSortingCreatedAtDesc
source: Newest first
pt: Mais recentes

# quotesListViewFilteringFavorites
source: Favorites
pt: Favoritos
